Documents/бит_ЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ЧекККМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_НачисленияКасс</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Итого</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвартироСъемщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКассы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПачки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСменыККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаКУ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ОплатаКУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сдача</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧекОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧекПробитНаККМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонИзвещений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихКодФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументБезНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Долг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолучательДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сальдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНаНачало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Счетчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрядность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БиллинговыеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолучательДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/бит_ВидыОперацийЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийЧекККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаВнешнийБиллинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратВнешнийБиллинг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_ЧекККМ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
	
// Функция ищет торговое оборудование добавленное в табличную часть КассыККМ
//
// Параметры:
//   ТипОборудования - Строка тип оборудования,				
//   КассаККМ		 - Ссылка на справочник бит_КассыККМ.
//
// Возвращаемое значение:
//   СписокОборудования   - Список значений, с перечислением ссылок на оборудование. 
//
Функция ПолучитьСписокОборудования(ТипОборудования, КассаККМ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_КассыККМПодключенноеОборудование.Оборудование КАК Ссылка,
	               |	ПодключаемоеОборудование.ИдентификаторУстройства,
	               |	ПодключаемоеОборудование.Наименование,
	               |	ПодключаемоеОборудование.Параметры,
	               |	ПодключаемоеОборудование.ДрайверОборудования
	               |ИЗ
	               |	Справочник.бит_КассыККМ.ПодключенноеОборудование КАК бит_КассыККМПодключенноеОборудование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	               |		ПО бит_КассыККМПодключенноеОборудование.Оборудование = ПодключаемоеОборудование.Ссылка
	               |ГДЕ
	               |	бит_КассыККМПодключенноеОборудование.Ссылка = &Ссылка
	               |	И ПодключаемоеОборудование.ТипОборудования = &ТипОборудования";
	Запрос.УстановитьПараметр("Ссылка", КассаККМ);
	Запрос.УстановитьПараметр("ТипОборудования", Перечисления.ТипыПодключаемогоОборудования[ТипОборудования]);
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Перебирая выборку составляем список устройств.
	СписокОборудования = Новый Массив();
	Пока Выборка.Следующий() Цикл
		// Заполним структуру данных устройства.
		ДанныеУстройства = Новый Структура();
		ДанныеУстройства.Вставить("Ссылка"                    , Выборка.Ссылка);
		ДанныеУстройства.Вставить("ИдентификаторУстройства"   , Выборка.ИдентификаторУстройства);
		ДанныеУстройства.Вставить("Наименование"              , Выборка.Наименование);
		ДанныеУстройства.Вставить("ИдентификаторОбъекта"      , Выборка.ДрайверОборудования.ИдентификаторОбъекта);
		ДанныеУстройства.Вставить("Параметры"                 , Выборка.Параметры.Получить());
		Если ТипЗнч(ДанныеУстройства.Параметры) = Тип("Структура") Тогда
			ДанныеУстройства.Параметры.Вставить("Идентификатор", Выборка.Ссылка); 
		КонецЕсли;
		СписокОборудования.Добавить(ДанныеУстройства);
	КонецЦикла;
	
	// Возвращаем полученный массив с данными всех найденных устройств.
	Возврат СписокОборудования;
	
КонецФункции

Функция СобратьДанныеЧеков(ДокументСсылка, НомерСекции = 0, ДоговорПА, ПокупательНомер = "", ПокупательEmail = "") Экспорт
	
	МассивЧеков = Новый Массив;
	
	ТаблицаУслуг = ?(ДокументСсылка.ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Продажа ИЛИ ДокументСсылка.ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Возврат, "Услуги", "БиллинговыеУслуги");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(ФизическиеЛица.ФИО, НЕОПРЕДЕЛЕНО) КАК КассирФИО,
	|	ЕСТЬNULL(ФизическиеЛица.ИНН, НЕОПРЕДЕЛЕНО) КАК КассирИНН
	|ПОМЕСТИТЬ Кассир
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО Пользователи.ФизическоеЛицо = ФизическиеЛица.Ссылка
	|ГДЕ
	|	Пользователи.Ссылка = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ЧекККМ.Организация,
	|	бит_ЧекККМ.Итого КАК СуммаДокумента,
	|	бит_ЧекККМ.Дата,
	|	бит_ЧекККМ.ВидОперации,
	|	Кассир.КассирФИО КАК Кассир,
	|	Кассир.КассирИНН
	|ИЗ
	|	Документ.бит_ЧекККМ КАК бит_ЧекККМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Кассир КАК Кассир
	|		ПО (ИСТИНА)
	|ГДЕ
	|	бит_ЧекККМ.Ссылка = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	// 19.12.2018  55
	|	ЕСТЬNULL(ТаблицаУслуг.Услуга.Номенклатура.ВидСтавкиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)) КАК СтавкаНДС,
	|	ТаблицаУслуг.Услуга КАК Услуга,
	|	СУММА(ТаблицаУслуг.Сумма) КАК Сумма
	|ИЗ
	|	Документ.бит_ЧекККМ.Услуги КАК ТаблицаУслуг
	|ГДЕ
	|	ТаблицаУслуг.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	//19.12.2018  55
	|	ЕСТЬNULL(ТаблицаУслуг.Услуга.Номенклатура.ВидСтавкиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)),
	|	ТаблицаУслуг.Услуга
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС),
	|	ЗНАЧЕНИЕ(Справочник.бит_УслугиЖКХ.Пеня),
	|	СУММА(ТаблицаПени.СуммаПени)
	|ИЗ
	|	Документ.бит_ЧекККМ.Услуги КАК ТаблицаПени
	|ГДЕ
	|	ТаблицаПени.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС),
	|	ЗНАЧЕНИЕ(Справочник.бит_УслугиЖКХ.Пеня)";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатШапка = РезультатЗапроса[1];
	СтруктураШапки = РезультатШапка.Выбрать();
	Если НЕ СтруктураШапки.Следующий() Тогда
		Возврат МассивЧеков;
	КонецЕсли;
	
	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(СтруктураШапки.Организация, СтруктураШапки.Дата);
	
	Если УчетнаяПолитика.ПрименяетсяУСНДоходы(СтруктураШапки.Организация, СтруктураШапки.Дата) Тогда
		НалоговыйРежим = 1;
	ИначеЕсли УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы(СтруктураШапки.Организация, СтруктураШапки.Дата) Тогда
		НалоговыйРежим = 2;
	Иначе
		НалоговыйРежим = 0;
	КонецЕсли;
	
	ИтогоСуммаЧеков = 0;
	
	// Шапка чека.
	ОбщиеПараметры = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
	
	ОбщиеПараметры.ТипРасчета = ?(СтруктураШапки.ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Возврат ИЛИ СтруктураШапки.ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.ВозвратВнешнийБиллинг,
		Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств,
		Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств);
		
	ОбщиеПараметры.Электронно = Ложь;
	
	// Параметры принтера чеков ЕНВД.
	ОбщиеПараметры.НомерКассы	= "00001";
	// БИТ_ЖКХ 11.07.2017 15:17:34 Начало правки...!!!! 
	//ОбщиеПараметры.НомерЧека	= 1;
	ОбщиеПараметры.НомерЧека	= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокументСсылка.Номер, Истина, Истина);
	// БИТ_ЖКХ 11.07.2017 15:17:40 Конец правки. 
	ОбщиеПараметры.НомерСмены	= 1;
	
	ОбщиеПараметры.ОрганизацияНазвание       = СведенияОбОрганизации.НаименованиеДляПечатныхФорм;
	ОбщиеПараметры.ОрганизацияИНН            = СведенияОбОрганизации.ИНН;
	ОбщиеПараметры.ОрганизацияКПП            = СведенияОбОрганизации.КПП;
	ОбщиеПараметры.АдресМагазина             = СведенияОбОрганизации.ФактическийАдрес;
	ОбщиеПараметры.КодСистемыНалогообложения = НалоговыйРежим;
	
	СписокПараметров = "Кассир, КассирИНН";
	ЗаполнитьЗначенияСвойств(ОбщиеПараметры, СтруктураШапки, СписокПараметров);
	
	ОбщиеПараметры.ПокупательНомер = ПокупательНомер;
	ОбщиеПараметры.ПокупательEmail = ПокупательEmail;
	
	// Строки чека.
	РезультатЧеки = РезультатЗапроса[2];
	ВыборкаПоСтавкамНДС = РезультатЧеки.Выбрать();

	Пока ВыборкаПоСтавкамНДС.Следующий() Цикл
		
		Если ВыборкаПоСтавкамНДС.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Перечисления.СтавкиНДС.БезНДС.
		СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
		СтрокаПозицииЧека.Наименование = Строка(ВыборкаПоСтавкамНДС.Услуга);
		СтрокаПозицииЧека.Количество   = 1;
		СтрокаПозицииЧека.Цена         = ВыборкаПоСтавкамНДС.Сумма;
		СтрокаПозицииЧека.Сумма        = ВыборкаПоСтавкамНДС.Сумма;
		СтрокаПозицииЧека.СтавкаНДС    = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ВыборкаПоСтавкамНДС.СтавкаНДС);
		СтрокаПозицииЧека.НомерСекции  = НомерСекции;
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
		
		ИтогоСуммаЧеков = ИтогоСуммаЧеков + ВыборкаПоСтавкамНДС.Сумма;
				
	КонецЦикла;
	
	СтрокаОплаты = Новый Структура();
	СтрокаОплаты.Вставить("ТипОплаты", 0);
	СтрокаОплаты.Вставить("Сумма", СтруктураШапки.СуммаДокумента);
	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);

	МассивЧеков.Добавить(ОбщиеПараметры);
	
	Возврат МассивЧеков;
	
КонецФункции

//Функция СистемаНалогообложения()
//	ПрименяетсяОсобыйПорядокНалогообложения = 
//		УчетнаяПолитика.ПрименяетсяОсобыйПорядокНалогообложения(Объект.Организация, Объект.Дата) 
//		ИЛИ (Объект.Товары.Количество()>0 И Объект.Товары[0].ОсобыйПорядок);
//	
//	НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
//	Если ПрименяетсяОсобыйПорядокНалогообложения Тогда
//		НалоговыйРежим = ?(УчетнаяПолитика.ПлательщикЕНВД(Объект.Организация, Объект.Дата), Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД, Перечисления.ТипыСистемНалогообложенияККТ.Патент);
//	ИначеЕсли УчетнаяПолитика.ПрименяетсяУСНДоходы(Объект.Организация, Объект.Дата) Тогда
//		НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход;
//	ИначеЕсли УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы(Объект.Организация, Объект.Дата) Тогда 
//		НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход;
//	КонецЕсли;
//	
//	Возврат НалоговыйРежим;
//КонецФункции

//Функция СобратьДанныеЧеков(ДокументСсылка, НомерСекции = 0, ВерсияФормата, СообщениеОбОшибке) Экспорт
//	
//	
//	
//	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата);
//	
//	ОбщиеПараметры = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
//	
//	ЭтоВерсия110 = НЕ ОбщегоНазначенияКлиентСервер.СравнитьВерсии("1.1.0.0", ВерсияФормата) > 0;
//	ЭтоВерсия105 = НЕ ОбщегоНазначенияКлиентСервер.СравнитьВерсии("1.0.5.0", ВерсияФормата) > 0;
//	
//	ОбщиеПараметры.ТипРасчета = ?(
//	Объект.ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Продажа, 
//	Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств, 
//	Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств);
//	
//	ДанныеКассира = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛицаТекущегоПользователя(Объект.Организация, Объект.Дата);
//	
//	ОбщиеПараметры.Кассир    = ?(ДанныеКассира.Представление = Неопределено, Неопределено, СокрЛП(СтрШаблон("%1 %2", Строка(ДанныеКассира.Должность), ДанныеКассира.Представление)));
//	ОбщиеПараметры.КассирИНН = ДанныеКассира.ИНН;
//	
//	ОбщиеПараметры.Электронно = Ложь;
//	
//	ОбщиеПараметры.НомерКассы     = "00001";
//	ОбщиеПараметры.НомерЧека      = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер, Истина, Истина);
//	ОбщиеПараметры.НомерСмены     = 1;
//	
//	ОбщиеПараметры.ОрганизацияНазвание = СведенияОбОрганизации.НаименованиеДляПечатныхФорм;
//	ОбщиеПараметры.ОрганизацияИНН      = СведенияОбОрганизации.ИНН;
//	ОбщиеПараметры.ОрганизацияКПП      = СведенияОбОрганизации.КПП;
//	ОбщиеПараметры.АдресМагазина       = СведенияОбОрганизации.ФактическийАдрес;
//	
//	ОбщиеПараметры.ОтправительEMail    = СведенияОбОрганизации.Email;
//	ОбщиеПараметры.ПокупательEmail     = "";
//	ОбщиеПараметры.ПокупательНомер     = "";
//	
//	ОбщиеПараметры.НаименованиеМагазина = СведенияОбОрганизации.НаименованиеДляПечатныхФорм;
//	
//	ОбщиеПараметры.СистемаНалогообложения = СистемаНалогообложения();
//	
//	// Подготовка таблицы товаров
//	ПараметрыПечатиЧека = ПодготовитьПараметрыПечатиЧека(ВерсияФормата);
//	
//	ТаблицаДокумента    = ПараметрыПечатиЧека.ТаблицаДокумента;
//	
//	СписокДоговоровПлатежногоАгента = ПараметрыПечатиЧека.ТаблицаДоговораПлатежногоАгента.ВыгрузитьКолонку("ДоговорКонтрагента");
//	
//	Если НЕ ЭтоВерсия110 
//		И (СписокДоговоровПлатежногоАгента.Количество() > 1 
//		ИЛИ (СписокДоговоровПлатежногоАгента.Количество() = 1 
//		И (Объект.Товары.Количество() > 0 
//		ИЛИ ПараметрыПечатиЧека.ТаблицаКомитенты.Итог("КоличествоДоговоров") > 1))) Тогда
//		ТекстСообщения = НСтр("ru = 'Для версии формата фискальных данных %1 возможен лишь один договор платежного агента в чеке'");
//		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ВерсияФормата);
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	Если СписокДоговоровПлатежногоАгента.Количество() = 1 
//		И ПараметрыПечатиЧека.ТаблицаКомитенты.Итог("КоличествоДоговоров") = 1 Тогда
//		СтруктураРеквизитов = УчетДенежныхСредствБП.РеквизитыПлатежногоАгента(СписокДоговоровПлатежногоАгента[0]);
//		ЗаполнитьЗначенияСвойств(ОбщиеПараметры, СтруктураРеквизитов);
//	ИначеЕсли ЭтоВерсия105 Тогда
//		СписокКомитентовУслуги = ПараметрыПечатиЧека.ТаблицаКомитенты.ВыгрузитьКолонку("Контрагент");
//		
//		Если НЕ ЭтоВерсия110 
//			И (СписокКомитентовУслуги.Количество() > 1 
//			ИЛИ (СписокКомитентовУслуги.Количество() = 1 И Объект.Товары.Количество() > 0 )) Тогда
//			ТекстСообщения = НСтр("ru = 'Для версии формата фискальных данных %1 возможен лишь один принципал в чеке'");
//			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ВерсияФормата);
//			Возврат Неопределено;
//		КонецЕсли;
//		
//		Если НЕ ЭтоВерсия110 И СписокКомитентовУслуги.Количество() = 1 Тогда 
//			// Версия фискальных данных < 1.1 и только один комитент на услуги
//			ОбщиеПараметры.ПризнакАгента = Перечисления.ПризнакиАгента.Агент;
//			КомитентПоЧеку = СписокКомитентовУслуги[0];
//			
//			ЗаполнитьЗначенияСвойств(ОбщиеПараметры.ДанныеПоставщика, ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КомитентПоЧеку, "Наименование, ИНН"));
//			ОбщиеПараметры.ДанныеПоставщика.Вставить("Телефон", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КомитентПоЧеку, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента));
//		Иначе
//			ПараметрыОбъекта = Новый Структура("Организация, Дата");
//			
//			ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
//			
//			МассивТоваровНаКомиссии = Новый Массив;
//			
//			СписокНоменклатуры = ТаблицаДокумента.ВыгрузитьКолонку("Номенклатура");
//			СведенияОСпискеНоменклатуры = БухгалтерскийУчетПереопределяемый.ПолучитьСведенияОСпискеНоменклатуры(СписокНоменклатуры, ПараметрыОбъекта, Истина, Ложь);
//			Для каждого СведенияОНоменклатуре Из СведенияОСпискеНоменклатуры Цикл
//				Если СведенияОНоменклатуре.Значение.Комиссионный Тогда
//					МассивТоваровНаКомиссии.Добавить(СведенияОНоменклатуре.Ключ);
//				КонецЕсли;
//			КонецЦикла;
//			
//			СведенияОКомитентах = УчетДенежныхСредствБП.ПолучитьСведенияОКомитентах(МассивТоваровНаКомиссии, ПараметрыОбъекта.Организация, ПараметрыОбъекта.Дата);
//			
//			КомитентПоЧеку = УчетДенежныхСредствБП.КомитентПоЧеку(СведенияОКомитентах, МассивТоваровНаКомиссии);
//			
//			Если КомитентПоЧеку <> Неопределено Тогда
//				ОбщиеПараметры.ПризнакАгента = Перечисления.ПризнакиАгента.Комиссионер;
//				
//				ЗаполнитьЗначенияСвойств(ОбщиеПараметры.ДанныеПоставщика, ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КомитентПоЧеку, "Наименование, ИНН"));
//				ОбщиеПараметры.ДанныеПоставщика.Вставить("Телефон", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КомитентПоЧеку, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента));
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Для каждого СтрокаТовары Из ТаблицаДокумента Цикл
//		СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
//		
//		ЗаполнитьЗначенияСвойств(СтрокаПозицииЧека, СтрокаТовары);
//		
//		СтрокаПозицииЧека.ЦенаСоСкидками = СтрокаПозицииЧека.Цена;
//		
//		Если ЭтоВерсия110  И ОбщиеПараметры.ПризнакАгента = Неопределено ТОгда
//			Если ЗначениеЗаполнено(СтрокаТовары.ДоговорКонтрагента) Тогда
//				РеквизитыАгента = УчетДенежныхСредствБП.РеквизитыПлатежногоАгента(СтрокаТовары.ДоговорКонтрагента);
//				ЗаполнитьЗначенияСвойств(СтрокаПозицииЧека, РеквизитыАгента);
//			ИначеЕсли ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда 
//				Комитент = СведенияОКомитентах[СтрокаТовары.Номенклатура];
//				Если Комитент <> Неопределено Тогда
//					ЗаполнитьЗначенияСвойств(СтрокаПозицииЧека.ДанныеПоставщика, ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Комитент, "Наименование, ИНН"));
//					СтрокаПозицииЧека.ДанныеПоставщика.Вставить("Телефон", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Комитент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента));
//				КонецЕсли; 
//			КонецЕсли;
//		КонецЕсли; 
//		
//		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
//	КонецЦикла;
//	
//	ОплатыПоДокументу = ПараметрыПечатиЧека.ТаблицаОплат;
//	
//	Если ПараметрыОплаты.ОплатаНаличные > 0 Тогда
//		СтрокаОплаты = ОплатыПоДокументу.Добавить();
//		СтрокаОплаты.ТипОплаты = 0;
//		СтрокаОплаты.Сумма = ПараметрыОплаты.ОплатаНаличные;
//	КонецЕсли;
//	
//	Для каждого СтрокаОплатыПоДокументу Из ОплатыПоДокументу Цикл
//		СтрокаОплаты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаОплатыПоДокументу);
//		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
//	КонецЦикла;
//	
//	
//	Возврат ОбщиеПараметры;

//	
//	
//	
//	
//	
//	
//	
//	
//	
//	
//	
//	
//	
//	МассивЧеков = Новый Массив;
//	
//	ПараметрыПечатиЧека = ПодготовитьПараметрыПечатиЧека(ДокументСсылка);
//	
//	РеквизитыПечатиЧека = ПараметрыПечатиЧека.РеквизитыПечатиЧека;
//	Если РеквизитыПечатиЧека.Количество() = 0 Тогда
//		Возврат МассивЧеков;
//	КонецЕсли;
//	
//	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РеквизитыПечатиЧека[0]);
//	
//	ПрименяетсяУСНПатент                    = УчетнаяПолитика.ПрименяетсяУСНПатент(Реквизиты.Организация, Реквизиты.Дата);
//	ПрименяетсяЕНВД                         = УчетнаяПолитика.ПлательщикЕНВД(Реквизиты.Организация, Реквизиты.Дата);
//	ПрименяетсяОсобыйПорядокНалогообложения = УчетнаяПолитика.ПрименяетсяОсобыйПорядокНалогообложения(Реквизиты.Организация, Реквизиты.Дата);
//	
//	ПрименяетсяТолькоПатент                 = ПрименяетсяОсобыйПорядокНалогообложения И ПрименяетсяУСНПатент;
//	ПрименяетсяТолькоЕНВД                   = ПрименяетсяОсобыйПорядокНалогообложения И ПрименяетсяЕНВД;
//	
//	Если ПрименяетсяТолькоПатент ИЛИ ЗначениеЗаполнено(Реквизиты.Патент) Тогда
//		НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.Патент;
//	ИначеЕсли ПрименяетсяТолькоЕНВД Тогда 
//		НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД;
//	ИначеЕсли УчетнаяПолитика.ПрименяетсяУСНДоходы(Реквизиты.Организация, Реквизиты.Дата) Тогда
//		НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход;
//	ИначеЕсли УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы(Реквизиты.Организация, Реквизиты.Дата) Тогда
//		НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход;
//	Иначе
//		НалоговыйРежим = Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
//	КонецЕсли;
//	
//	
//	ТипРасчета = ?(Реквизиты.ВидОперации = Перечисления.бит_ВидыОперацийЧекККМ.Возврат, 
//		Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств,
//		Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств);
//		
//	Реквизиты.Вставить("НалоговыйРежим",          НалоговыйРежим);
//	Реквизиты.Вставить("ТипРасчета",              ТипРасчета);
//	Реквизиты.Вставить("НаименованиеВСтрокеЧека", НаименованиеВСтрокеЧека(Реквизиты));
//	Реквизиты.Вставить("НомерСекции",             НомерСекции);
//	Реквизиты.Вставить("ТипОплаты",               Перечисления.ТипыОплатыККТ.Наличные);
//	
//	ПараметрыОперацииФискализацииЧека = УчетДенежныхСредствБП.ПараметрыОперацииФискализацииЧека(Реквизиты, ПараметрыПечатиЧека, ВерсияФормата, СообщениеОбОшибке);

//	МассивЧеков.Добавить(ПараметрыОперацииФискализацииЧека);
//	
//	Возврат МассивЧеков;
//	
//КонецФункции

//Функция ПодготовитьПараметрыПечатиЧека(ДокументСсылка)
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("бит_ЧекККМ", ДокументСсылка);
//	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
//	
//	НомераТаблиц = Новый Структура;
//	
//	//Запрос.Текст =
//	//"ВЫБРАТЬ
//	//|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорПлатежногоАгента,
//	//|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка
//	//|ПОМЕСТИТЬ ВТ_ДоговораПлатежногоАгента
//	//|ИЗ
//	//|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
//	//|ГДЕ
//	//|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = &ПриходныйКассовыйОрдер
//	//|	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента.ПлатежныйАгент
//	//|
//	//|СГРУППИРОВАТЬ ПО
//	//|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента,
//	//|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка
//	//|
//	//|ОБЪЕДИНИТЬ ВСЕ
//	//|
//	//|ВЫБРАТЬ
//	//|	ПриходныйКассовыйОрдер.СубконтоКт2,
//	//|	ПриходныйКассовыйОрдер.Ссылка
//	//|ИЗ
//	//|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
//	//|ГДЕ
//	//|	ВЫРАЗИТЬ(ПриходныйКассовыйОрдер.СубконтоКт2 КАК Справочник.ДоговорыКонтрагентов).ПлатежныйАгент
//	//|	И ПриходныйКассовыйОрдер.Ссылка = &ПриходныйКассовыйОрдер
//	//|;
//	//|
//	//|////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ
//	//|	ПриходныйКассовыйОрдер.Ссылка,
//	//|	ПриходныйКассовыйОрдер.Дата,
//	//|	ПриходныйКассовыйОрдер.Номер,
//	//|	ПриходныйКассовыйОрдер.Организация,
//	//|	ПриходныйКассовыйОрдер.Патент,
//	//|	ПриходныйКассовыйОрдер.Основание,
//	//|	ПриходныйКассовыйОрдер.ВидОперации,
//	//|	ПриходныйКассовыйОрдер.Контрагент,
//	//|	ПриходныйКассовыйОрдер.ПринятоОт,
//	//|	ПриходныйКассовыйОрдер.СтавкаНДС,
//	//|	ПриходныйКассовыйОрдер.СуммаДокумента,
//	//|	ПриходныйКассовыйОрдер.ВалютаДокумента,
//	//|	ЕСТЬNULL(ВТ_ДоговораПлатежногоАгента.ДоговорПлатежногоАгента, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК ДоговорПлатежногоАгента,
//	//|	ЕСТЬNULL(ВТ_ДоговораПлатежногоАгента.КоличествоДоговоров, 0) > 1 КАК НесколькоДоговоровПлатежногоАгента
//	//|ПОМЕСТИТЬ ВТ_РеквизитыШапки
//	//|ИЗ
//	//|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
//	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	//|			ВТ_ДоговораПлатежногоАгента.Ссылка КАК Ссылка,
//	//|			МАКСИМУМ(ВТ_ДоговораПлатежногоАгента.ДоговорПлатежногоАгента) КАК ДоговорПлатежногоАгента,
//	//|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДоговораПлатежногоАгента.ДоговорПлатежногоАгента) КАК КоличествоДоговоров
//	//|		ИЗ
//	//|			ВТ_ДоговораПлатежногоАгента КАК ВТ_ДоговораПлатежногоАгента
//	//|		
//	//|		СГРУППИРОВАТЬ ПО
//	//|			ВТ_ДоговораПлатежногоАгента.Ссылка) КАК ВТ_ДоговораПлатежногоАгента
//	//|		ПО ПриходныйКассовыйОрдер.Ссылка = ВТ_ДоговораПлатежногоАгента.Ссылка
//	//|ГДЕ
//	//|	ПриходныйКассовыйОрдер.Ссылка = &ПриходныйКассовыйОрдер
//	//|;
//	//|
//	//|////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ
//	//|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
//	//|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента,
//	//|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СтавкаНДС,
//	//|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СчетНаОплату,
//	//|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаПлатежа,
//	//|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов
//	//|ПОМЕСТИТЬ ВТ_РасшифровкаПлатежа
//	//|ИЗ
//	//|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
//	//|ГДЕ
//	//|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = &ПриходныйКассовыйОрдер
//	//|;
//	//|
//	//|////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ
//	//|	РеализацияТоваровУслуг.Ссылка КАК РеализацияТоваров,
//	//|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СчетНаОплату
//	//|ПОМЕСТИТЬ ВТ_РеализацииПоСчету
//	//|ИЗ
//	//|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
//	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
//	//|		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.СчетНаОплату = РеализацияТоваровУслуг.СчетНаОплатуПокупателю
//	//|ГДЕ
//	//|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = &ПриходныйКассовыйОрдер
//	//|	И НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
//	//|;
//	//|
//	//|////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ
//	//|	ВТ_РеквизитыШапки.Организация,
//	//|	ВТ_РеквизитыШапки.СуммаДокумента,
//	//|	ВТ_РеквизитыШапки.Контрагент,
//	//|	ВТ_РеквизитыШапки.ПринятоОт,
//	//|	ВТ_РеквизитыШапки.Основание,
//	//|	ВТ_РеквизитыШапки.Дата,
//	//|	ВТ_РеквизитыШапки.Номер,
//	//|	ВТ_РеквизитыШапки.ВидОперации,
//	//|	ВТ_РеквизитыШапки.Патент,
//	//|	ВТ_РеквизитыШапки.СтавкаНДС,
//	//|	ВТ_РеквизитыШапки.ДоговорПлатежногоАгента,
//	//|	ВТ_РеквизитыШапки.НесколькоДоговоровПлатежногоАгента
//	//|ИЗ
//	//|	ВТ_РеквизитыШапки КАК ВТ_РеквизитыШапки
//	//|;
//	//|
//	//|////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ
//	//|	ВложенныйЗапрос.СчетНаОплату,
//	//|	ВложенныйЗапрос.ЭтоУслуга,
//	//|	ВложенныйЗапрос.Номенклатура,
//	//|	ВложенныйЗапрос.Содержание,
//	//|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
//	//|ПОМЕСТИТЬ ВТ_РеализованнаяНоменклатура
//	//|ИЗ
//	//|	(ВЫБРАТЬ
//	//|		ВТ_РеализацииПоСчету.СчетНаОплату КАК СчетНаОплату,
//	//|		ЛОЖЬ КАК ЭтоУслуга,
//	//|		РеализованныеТовары.Номенклатура КАК Номенклатура,
//	//|		"""" КАК Содержание,
//	//|		РеализованныеТовары.Количество КАК Количество
//	//|	ИЗ
//	//|		ВТ_РеализацииПоСчету КАК ВТ_РеализацииПоСчету
//	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализованныеТовары
//	//|			ПО ВТ_РеализацииПоСчету.РеализацияТоваров = РеализованныеТовары.Ссылка
//	//|	
//	//|	ОБЪЕДИНИТЬ ВСЕ
//	//|	
//	//|	ВЫБРАТЬ
//	//|		ВТ_РеализацииПоСчету.СчетНаОплату,
//	//|		ИСТИНА,
//	//|		РеализованныеУслуги.Номенклатура,
//	//|		РеализованныеУслуги.Содержание,
//	//|		ВЫБОР
//	//|			КОГДА РеализованныеУслуги.Количество = 0
//	//|				ТОГДА 1
//	//|			ИНАЧЕ РеализованныеУслуги.Количество
//	//|		КОНЕЦ
//	//|	ИЗ
//	//|		ВТ_РеализацииПоСчету КАК ВТ_РеализацииПоСчету
//	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализованныеУслуги
//	//|			ПО ВТ_РеализацииПоСчету.РеализацияТоваров = РеализованныеУслуги.Ссылка
//	//|	
//	//|	ОБЪЕДИНИТЬ ВСЕ
//	//|	
//	//|	ВЫБРАТЬ
//	//|		ВТ_РеализацииПоСчету.СчетНаОплату,
//	//|		ИСТИНА,
//	//|		РеализованныеАгентскиеУслуги.Номенклатура,
//	//|		РеализованныеАгентскиеУслуги.Содержание,
//	//|		ВЫБОР
//	//|			КОГДА РеализованныеАгентскиеУслуги.Количество = 0
//	//|				ТОГДА 1
//	//|			ИНАЧЕ РеализованныеАгентскиеУслуги.Количество
//	//|		КОНЕЦ
//	//|	ИЗ
//	//|		ВТ_РеализацииПоСчету КАК ВТ_РеализацииПоСчету
//	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализованныеАгентскиеУслуги
//	//|			ПО ВТ_РеализацииПоСчету.РеализацияТоваров = РеализованныеАгентскиеУслуги.Ссылка) КАК ВложенныйЗапрос
//	//|
//	//|СГРУППИРОВАТЬ ПО
//	//|	ВложенныйЗапрос.СчетНаОплату,
//	//|	ВложенныйЗапрос.ЭтоУслуга,
//	//|	ВложенныйЗапрос.Номенклатура,
//	//|	ВложенныйЗапрос.Содержание
//	//|;
//	//|
//	//|////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ
//	//|	ВТ_РасшифровкаПлатежа.СчетНаОплату КАК Документ,
//	//|	ДокументСчетНаОплатуПокупателю.Организация КАК Организация,
//	//|	ДокументСчетНаОплатуПокупателю.Дата КАК Дата,
//	//|	ЕСТЬNULL(ДокументСчетНаОплатуПокупателю.СуммаВключаетНДС, ИСТИНА) КАК СуммаВключаетНДС,
//	//|	ЕСТЬNULL(ДокументСчетНаОплатуПокупателю.СуммаСкидки, 0) КАК СуммаСкидкиПоДокументу,
//	//|	ВТ_РасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорКонтрагента,
//	//|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
//	//|	ЕСТЬNULL(ДокументСчетНаОплатуПокупателю.ВалютаДокумента, &ВалютаРегламентированногоУчета) КАК ВалютаДокумента,
//	//|	ВТ_РеквизитыШапки.ВалютаДокумента КАК ВалютаПлатежа,
//	//|	СУММА(ВТ_РасшифровкаПлатежа.СуммаПлатежа) КАК СуммаОплаты,
//	//|	СУММА(ВТ_РасшифровкаПлатежа.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
//	//|	ВТ_РасшифровкаПлатежа.СтавкаНДС
//	//|ПОМЕСТИТЬ ВТ_ОплачиваемыеДокументы
//	//|ИЗ
//	//|	ВТ_РасшифровкаПлатежа КАК ВТ_РасшифровкаПлатежа
//	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыШапки КАК ВТ_РеквизитыШапки
//	//|		ПО ВТ_РасшифровкаПлатежа.Ссылка = ВТ_РеквизитыШапки.Ссылка
//	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК ДокументСчетНаОплатуПокупателю
//	//|		ПО ВТ_РасшифровкаПлатежа.СчетНаОплату = ДокументСчетНаОплатуПокупателю.Ссылка
//	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
//	//|		ПО ВТ_РасшифровкаПлатежа.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
//	//|
//	//|СГРУППИРОВАТЬ ПО
//	//|	ВТ_РасшифровкаПлатежа.СтавкаНДС,
//	//|	ДокументСчетНаОплатуПокупателю.Организация,
//	//|	ДокументСчетНаОплатуПокупателю.Дата,
//	//|	ВТ_РасшифровкаПлатежа.СчетНаОплату,
//	//|	ЕСТЬNULL(ДокументСчетНаОплатуПокупателю.СуммаВключаетНДС, ИСТИНА),
//	//|	ВТ_РеквизитыШапки.ВалютаДокумента,
//	//|	ВТ_РасшифровкаПлатежа.ДоговорКонтрагента,
//	//|	ЕСТЬNULL(ДокументСчетНаОплатуПокупателю.ВалютаДокумента, &ВалютаРегламентированногоУчета),
//	//|	ЕСТЬNULL(ДокументСчетНаОплатуПокупателю.СуммаСкидки, 0),
//	//|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
//	//|;
//	//|
//	//|////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ
//	//|	СчетНаОплатуПокупателюТовары.Ссылка КАК Документ,
//	//|	СчетНаОплатуПокупателюТовары.Ссылка.Дата КАК ДатаДокумента,
//	//|	СчетНаОплатуПокупателюТовары.Номенклатура,
//	//|	ВЫБОР
//	//|		КОГДА НЕ СчетНаОплатуПокупателюТовары.Содержание ПОДОБНО """"
//	//|			ТОГДА СчетНаОплатуПокупателюТовары.Содержание
//	//|		КОГДА НЕ СчетНаОплатуПокупателюТовары.Номенклатура.НаименованиеПолное ПОДОБНО """"
//	//|			ТОГДА СчетНаОплатуПокупателюТовары.Номенклатура.НаименованиеПолное
//	//|		ИНАЧЕ СчетНаОплатуПокупателюТовары.Номенклатура.Наименование
//	//|	КОНЕЦ КАК Наименование,
//	//|	МАКСИМУМ(ЕСТЬNULL(ШтрихкодыНоменклатуры.Штрихкод, НЕОПРЕДЕЛЕНО)) КАК Штрихкод,
//	//|	СУММА(ВЫБОР
//	//|			КОГДА СчетНаОплатуПокупателюТовары.Количество = 0
//	//|					И ЕСТЬNULL(СчетНаОплатуПокупателюТовары.Номенклатура.Услуга, ИСТИНА)
//	//|				ТОГДА 1
//	//|			ИНАЧЕ СчетНаОплатуПокупателюТовары.Количество
//	//|		КОНЕЦ) КАК Количество,
//	//|	ВЫРАЗИТЬ(ВЫБОР
//	//|			КОГДА ВТ_ОплачиваемыеДокументы.СуммаВключаетНДС
//	//|				ТОГДА СчетНаОплатуПокупателюТовары.Цена
//	//|			КОГДА СчетНаОплатуПокупателюТовары.Количество = 0
//	//|				ТОГДА СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
//	//|			ИНАЧЕ (СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС) / СчетНаОплатуПокупателюТовары.Количество
//	//|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Цена,
//	//|	СУММА(СчетНаОплатуПокупателюТовары.СуммаСкидки) КАК СуммаСкидок,
//	//|	СчетНаОплатуПокупателюТовары.СтавкаНДС,
//	//|	СУММА(ВЫБОР
//	//|			КОГДА ВТ_ОплачиваемыеДокументы.СуммаВключаетНДС
//	//|				ТОГДА СчетНаОплатуПокупателюТовары.Сумма - СчетНаОплатуПокупателюТовары.СуммаСкидки
//	//|			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС - СчетНаОплатуПокупателюТовары.СуммаСкидки
//	//|		КОНЕЦ) КАК Сумма,
//	//|	СУММА(ЕСТЬNULL(ВТ_РеализованнаяНоменклатура.Количество, 0)) КАК КоличествоОтгружено
//	//|ИЗ
//	//|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
//	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОплачиваемыеДокументы КАК ВТ_ОплачиваемыеДокументы
//	//|		ПО СчетНаОплатуПокупателюТовары.Ссылка = ВТ_ОплачиваемыеДокументы.Документ
//	//|			И СчетНаОплатуПокупателюТовары.СтавкаНДС = ВТ_ОплачиваемыеДокументы.СтавкаНДС
//	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
//	//|		ПО СчетНаОплатуПокупателюТовары.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
//	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеализованнаяНоменклатура КАК ВТ_РеализованнаяНоменклатура
//	//|		ПО (ВТ_РеализованнаяНоменклатура.СчетНаОплату = СчетНаОплатуПокупателюТовары.Ссылка)
//	//|			И (ВТ_РеализованнаяНоменклатура.Номенклатура = СчетНаОплатуПокупателюТовары.Номенклатура)
//	//|			И (ВТ_РеализованнаяНоменклатура.Содержание = СчетНаОплатуПокупателюТовары.Содержание)
//	//|ГДЕ
//	//|	(СчетНаОплатуПокупателюТовары.Количество <> 0
//	//|			ИЛИ ЕСТЬNULL(СчетНаОплатуПокупателюТовары.Номенклатура.Услуга, ИСТИНА))
//	//|	И НЕ ВТ_ОплачиваемыеДокументы.Документ ЕСТЬ NULL
//	//|
//	//|СГРУППИРОВАТЬ ПО
//	//|	СчетНаОплатуПокупателюТовары.Ссылка,
//	//|	СчетНаОплатуПокупателюТовары.Ссылка.Дата,
//	//|	ВЫБОР
//	//|		КОГДА НЕ СчетНаОплатуПокупателюТовары.Содержание ПОДОБНО """"
//	//|			ТОГДА СчетНаОплатуПокупателюТовары.Содержание
//	//|		КОГДА НЕ СчетНаОплатуПокупателюТовары.Номенклатура.НаименованиеПолное ПОДОБНО """"
//	//|			ТОГДА СчетНаОплатуПокупателюТовары.Номенклатура.НаименованиеПолное
//	//|		ИНАЧЕ СчетНаОплатуПокупателюТовары.Номенклатура.Наименование
//	//|	КОНЕЦ,
//	//|	СчетНаОплатуПокупателюТовары.СтавкаНДС,
//	//|	ВЫРАЗИТЬ(ВЫБОР
//	//|			КОГДА ВТ_ОплачиваемыеДокументы.СуммаВключаетНДС
//	//|				ТОГДА СчетНаОплатуПокупателюТовары.Цена
//	//|			КОГДА СчетНаОплатуПокупателюТовары.Количество = 0
//	//|				ТОГДА СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
//	//|			ИНАЧЕ (СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС) / СчетНаОплатуПокупателюТовары.Количество
//	//|		КОНЕЦ КАК ЧИСЛО(15, 2)),
//	//|	СчетНаОплатуПокупателюТовары.Номенклатура
//	//|;
//	//|
//	//|////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ
//	//|	ОплачиваемыеСчета.Документ,
//	//|	ОплачиваемыеСчета.Организация,
//	//|	ОплачиваемыеСчета.Дата,
//	//|	ОплачиваемыеСчета.СуммаСкидкиПоДокументу,
//	//|	ОплачиваемыеСчета.РасчетыВУсловныхЕдиницах
//	//|		И ОплачиваемыеСчета.ВалютаДокумента <> ОплачиваемыеСчета.ВалютаПлатежа КАК РасчетыВУсловныхЕдиницах,
//	//|	ОплачиваемыеСчета.СтавкаНДС,
//	//|	ОплачиваемыеСчета.СуммаОплаты,
//	//|	ОплачиваемыеСчета.СуммаВзаиморасчетов,
//	//|	СУММА(ЕСТЬNULL(ОплатаСчетов.Сумма, 0)) КАК СуммаОплатыВсего
//	//|ИЗ
//	//|	ВТ_ОплачиваемыеДокументы КАК ОплачиваемыеСчета
//	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОплатаСчетов КАК ОплатаСчетов
//	//|		ПО ОплачиваемыеСчета.Документ = ОплатаСчетов.СчетНаОплату
//	//|			И ОплачиваемыеСчета.СтавкаНДС = ОплатаСчетов.СтавкаНДС
//	//|			И ОплачиваемыеСчета.Организация = ОплатаСчетов.Организация
//	//|
//	//|СГРУППИРОВАТЬ ПО
//	//|	ОплачиваемыеСчета.СтавкаНДС,
//	//|	ОплачиваемыеСчета.Документ,
//	//|	ОплачиваемыеСчета.Организация,
//	//|	ОплачиваемыеСчета.Дата,
//	//|	ОплачиваемыеСчета.СуммаОплаты,
//	//|	ОплачиваемыеСчета.СуммаВзаиморасчетов,
//	//|	ОплачиваемыеСчета.РасчетыВУсловныхЕдиницах
//	//|		И ОплачиваемыеСчета.ВалютаДокумента <> ОплачиваемыеСчета.ВалютаПлатежа,
//	//|	ОплачиваемыеСчета.СуммаСкидкиПоДокументу"
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсыка) КАК ДоговорПлатежногоАгента,
//	|	бит_ЧекККМ.Ссылка
//	|ПОМЕСТИТЬ ВТ_ДоговораПлатежногоАгента
//	|ИЗ
//	|	Документ.бит_ЧекККМ КАК бит_ЧекККМ
//	|ГДЕ
//	|	бит_ЧекККМ.Ссылка = &бит_ЧекККМ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	бит_ЧекККМ.Ссылка,
//	|	бит_ЧекККМ.Дата,
//	|	бит_ЧекККМ.Номер,
//	|	бит_ЧекККМ.Организация,
//	|	ЗНАЧЕНИЕ(Справочник.Патенты.ПустаяСсылка) КАК Патент,
//	|	"""" КАК Основание,
//	|	бит_ЧекККМ.ВидОперации,
//	|	бит_ЧекККМ.Контрагент,
//	|	бит_ЧекККМ.ПринятоОт,
//	|	бит_ЧекККМ.СтавкаНДС,
//	|	бит_ЧекККМ.СуммаДокумента,
//	|	бит_ЧекККМ.ВалютаДокумента,
//	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорПлатежногоАгента,
//	|	0 > 1 КАК НесколькоДоговоровПлатежногоАгента
//	|ПОМЕСТИТЬ ВТ_РеквизитыШапки
//	|ИЗ
//	|	Документ.бит_ЧекККМ КАК бит_ЧекККМ
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			ВТ_ДоговораПлатежногоАгента.Ссылка КАК Ссылка,
//	|			МАКСИМУМ(ВТ_ДоговораПлатежногоАгента.ДоговорПлатежногоАгента) КАК ДоговорПлатежногоАгента,
//	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДоговораПлатежногоАгента.ДоговорПлатежногоАгента) КАК КоличествоДоговоров
//	|		ИЗ
//	|			ВТ_ДоговораПлатежногоАгента КАК ВТ_ДоговораПлатежногоАгента
//	|		
//	|		СГРУППИРОВАТЬ ПО
//	|			ВТ_ДоговораПлатежногоАгента.Ссылка) КАК ВТ_ДоговораПлатежногоАгента
//	|		ПО ПриходныйКассовыйОрдер.Ссылка = ВТ_ДоговораПлатежногоАгента.Ссылка
//	|ГДЕ
//	|	ПриходныйКассовыйОрдер.Ссылка = &ПриходныйКассовыйОрдер
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
//	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента,
//	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СтавкаНДС,
//	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СчетНаОплату,
//	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаПлатежа,
//	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов
//	|ПОМЕСТИТЬ ВТ_РасшифровкаПлатежа
//	|ИЗ
//	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
//	|ГДЕ
//	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = &ПриходныйКассовыйОрдер
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РеализацияТоваровУслуг.Ссылка КАК РеализацияТоваров,
//	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СчетНаОплату
//	|ПОМЕСТИТЬ ВТ_РеализацииПоСчету
//	|ИЗ
//	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
//	|		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.СчетНаОплату = РеализацияТоваровУслуг.СчетНаОплатуПокупателю
//	|ГДЕ
//	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = &ПриходныйКассовыйОрдер
//	|	И НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_РеквизитыШапки.Организация,
//	|	ВТ_РеквизитыШапки.СуммаДокумента,
//	|	ВТ_РеквизитыШапки.Контрагент,
//	|	ВТ_РеквизитыШапки.ПринятоОт,
//	|	ВТ_РеквизитыШапки.Основание,
//	|	ВТ_РеквизитыШапки.Дата,
//	|	ВТ_РеквизитыШапки.Номер,
//	|	ВТ_РеквизитыШапки.ВидОперации,
//	|	ВТ_РеквизитыШапки.Патент,
//	|	ВТ_РеквизитыШапки.СтавкаНДС,
//	|	ВТ_РеквизитыШапки.ДоговорПлатежногоАгента,
//	|	ВТ_РеквизитыШапки.НесколькоДоговоровПлатежногоАгента
//	|ИЗ
//	|	ВТ_РеквизитыШапки КАК ВТ_РеквизитыШапки
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВложенныйЗапрос.СчетНаОплату,
//	|	ВложенныйЗапрос.ЭтоУслуга,
//	|	ВложенныйЗапрос.Номенклатура,
//	|	ВложенныйЗапрос.Содержание,
//	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
//	|ПОМЕСТИТЬ ВТ_РеализованнаяНоменклатура
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		ВТ_РеализацииПоСчету.СчетНаОплату КАК СчетНаОплату,
//	|		ЛОЖЬ КАК ЭтоУслуга,
//	|		РеализованныеТовары.Номенклатура КАК Номенклатура,
//	|		"""" КАК Содержание,
//	|		РеализованныеТовары.Количество КАК Количество
//	|	ИЗ
//	|		ВТ_РеализацииПоСчету КАК ВТ_РеализацииПоСчету
//	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализованныеТовары
//	|			ПО ВТ_РеализацииПоСчету.РеализацияТоваров = РеализованныеТовары.Ссылка
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		ВТ_РеализацииПоСчету.СчетНаОплату,
//	|		ИСТИНА,
//	|		РеализованныеУслуги.Номенклатура,
//	|		РеализованныеУслуги.Содержание,
//	|		ВЫБОР
//	|			КОГДА РеализованныеУслуги.Количество = 0
//	|				ТОГДА 1
//	|			ИНАЧЕ РеализованныеУслуги.Количество
//	|		КОНЕЦ
//	|	ИЗ
//	|		ВТ_РеализацииПоСчету КАК ВТ_РеализацииПоСчету
//	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализованныеУслуги
//	|			ПО ВТ_РеализацииПоСчету.РеализацияТоваров = РеализованныеУслуги.Ссылка
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		ВТ_РеализацииПоСчету.СчетНаОплату,
//	|		ИСТИНА,
//	|		РеализованныеАгентскиеУслуги.Номенклатура,
//	|		РеализованныеАгентскиеУслуги.Содержание,
//	|		ВЫБОР
//	|			КОГДА РеализованныеАгентскиеУслуги.Количество = 0
//	|				ТОГДА 1
//	|			ИНАЧЕ РеализованныеАгентскиеУслуги.Количество
//	|		КОНЕЦ
//	|	ИЗ
//	|		ВТ_РеализацииПоСчету КАК ВТ_РеализацииПоСчету
//	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализованныеАгентскиеУслуги
//	|			ПО ВТ_РеализацииПоСчету.РеализацияТоваров = РеализованныеАгентскиеУслуги.Ссылка) КАК ВложенныйЗапрос
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВложенныйЗапрос.СчетНаОплату,
//	|	ВложенныйЗапрос.ЭтоУслуга,
//	|	ВложенныйЗапрос.Номенклатура,
//	|	ВложенныйЗапрос.Содержание
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_РасшифровкаПлатежа.СчетНаОплату КАК Документ,
//	|	ДокументСчетНаОплатуПокупателю.Организация КАК Организация,
//	|	ДокументСчетНаОплатуПокупателю.Дата КАК Дата,
//	|	ЕСТЬNULL(ДокументСчетНаОплатуПокупателю.СуммаВключаетНДС, ИСТИНА) КАК СуммаВключаетНДС,
//	|	ЕСТЬNULL(ДокументСчетНаОплатуПокупателю.СуммаСкидки, 0) КАК СуммаСкидкиПоДокументу,
//	|	ВТ_РасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорКонтрагента,
//	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
//	|	ЕСТЬNULL(ДокументСчетНаОплатуПокупателю.ВалютаДокумента, &ВалютаРегламентированногоУчета) КАК ВалютаДокумента,
//	|	ВТ_РеквизитыШапки.ВалютаДокумента КАК ВалютаПлатежа,
//	|	СУММА(ВТ_РасшифровкаПлатежа.СуммаПлатежа) КАК СуммаОплаты,
//	|	СУММА(ВТ_РасшифровкаПлатежа.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
//	|	ВТ_РасшифровкаПлатежа.СтавкаНДС
//	|ПОМЕСТИТЬ ВТ_ОплачиваемыеДокументы
//	|ИЗ
//	|	ВТ_РасшифровкаПлатежа КАК ВТ_РасшифровкаПлатежа
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыШапки КАК ВТ_РеквизитыШапки
//	|		ПО ВТ_РасшифровкаПлатежа.Ссылка = ВТ_РеквизитыШапки.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК ДокументСчетНаОплатуПокупателю
//	|		ПО ВТ_РасшифровкаПлатежа.СчетНаОплату = ДокументСчетНаОплатуПокупателю.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
//	|		ПО ВТ_РасшифровкаПлатежа.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТ_РасшифровкаПлатежа.СтавкаНДС,
//	|	ДокументСчетНаОплатуПокупателю.Организация,
//	|	ДокументСчетНаОплатуПокупателю.Дата,
//	|	ВТ_РасшифровкаПлатежа.СчетНаОплату,
//	|	ЕСТЬNULL(ДокументСчетНаОплатуПокупателю.СуммаВключаетНДС, ИСТИНА),
//	|	ВТ_РеквизитыШапки.ВалютаДокумента,
//	|	ВТ_РасшифровкаПлатежа.ДоговорКонтрагента,
//	|	ЕСТЬNULL(ДокументСчетНаОплатуПокупателю.ВалютаДокумента, &ВалютаРегламентированногоУчета),
//	|	ЕСТЬNULL(ДокументСчетНаОплатуПокупателю.СуммаСкидки, 0),
//	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СчетНаОплатуПокупателюТовары.Ссылка КАК Документ,
//	|	СчетНаОплатуПокупателюТовары.Ссылка.Дата КАК ДатаДокумента,
//	|	СчетНаОплатуПокупателюТовары.Номенклатура,
//	|	ВЫБОР
//	|		КОГДА НЕ СчетНаОплатуПокупателюТовары.Содержание ПОДОБНО """"
//	|			ТОГДА СчетНаОплатуПокупателюТовары.Содержание
//	|		КОГДА НЕ СчетНаОплатуПокупателюТовары.Номенклатура.НаименованиеПолное ПОДОБНО """"
//	|			ТОГДА СчетНаОплатуПокупателюТовары.Номенклатура.НаименованиеПолное
//	|		ИНАЧЕ СчетНаОплатуПокупателюТовары.Номенклатура.Наименование
//	|	КОНЕЦ КАК Наименование,
//	|	МАКСИМУМ(ЕСТЬNULL(ШтрихкодыНоменклатуры.Штрихкод, НЕОПРЕДЕЛЕНО)) КАК Штрихкод,
//	|	СУММА(ВЫБОР
//	|			КОГДА СчетНаОплатуПокупателюТовары.Количество = 0
//	|					И ЕСТЬNULL(СчетНаОплатуПокупателюТовары.Номенклатура.Услуга, ИСТИНА)
//	|				ТОГДА 1
//	|			ИНАЧЕ СчетНаОплатуПокупателюТовары.Количество
//	|		КОНЕЦ) КАК Количество,
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|			КОГДА ВТ_ОплачиваемыеДокументы.СуммаВключаетНДС
//	|				ТОГДА СчетНаОплатуПокупателюТовары.Цена
//	|			КОГДА СчетНаОплатуПокупателюТовары.Количество = 0
//	|				ТОГДА СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
//	|			ИНАЧЕ (СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС) / СчетНаОплатуПокупателюТовары.Количество
//	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Цена,
//	|	СУММА(СчетНаОплатуПокупателюТовары.СуммаСкидки) КАК СуммаСкидок,
//	|	СчетНаОплатуПокупателюТовары.СтавкаНДС,
//	|	СУММА(ВЫБОР
//	|			КОГДА ВТ_ОплачиваемыеДокументы.СуммаВключаетНДС
//	|				ТОГДА СчетНаОплатуПокупателюТовары.Сумма - СчетНаОплатуПокупателюТовары.СуммаСкидки
//	|			ИНАЧЕ СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС - СчетНаОплатуПокупателюТовары.СуммаСкидки
//	|		КОНЕЦ) КАК Сумма,
//	|	СУММА(ЕСТЬNULL(ВТ_РеализованнаяНоменклатура.Количество, 0)) КАК КоличествоОтгружено
//	|ИЗ
//	|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОплачиваемыеДокументы КАК ВТ_ОплачиваемыеДокументы
//	|		ПО СчетНаОплатуПокупателюТовары.Ссылка = ВТ_ОплачиваемыеДокументы.Документ
//	|			И СчетНаОплатуПокупателюТовары.СтавкаНДС = ВТ_ОплачиваемыеДокументы.СтавкаНДС
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
//	|		ПО СчетНаОплатуПокупателюТовары.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеализованнаяНоменклатура КАК ВТ_РеализованнаяНоменклатура
//	|		ПО (ВТ_РеализованнаяНоменклатура.СчетНаОплату = СчетНаОплатуПокупателюТовары.Ссылка)
//	|			И (ВТ_РеализованнаяНоменклатура.Номенклатура = СчетНаОплатуПокупателюТовары.Номенклатура)
//	|			И (ВТ_РеализованнаяНоменклатура.Содержание = СчетНаОплатуПокупателюТовары.Содержание)
//	|ГДЕ
//	|	(СчетНаОплатуПокупателюТовары.Количество <> 0
//	|			ИЛИ ЕСТЬNULL(СчетНаОплатуПокупателюТовары.Номенклатура.Услуга, ИСТИНА))
//	|	И НЕ ВТ_ОплачиваемыеДокументы.Документ ЕСТЬ NULL
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	СчетНаОплатуПокупателюТовары.Ссылка,
//	|	СчетНаОплатуПокупателюТовары.Ссылка.Дата,
//	|	ВЫБОР
//	|		КОГДА НЕ СчетНаОплатуПокупателюТовары.Содержание ПОДОБНО """"
//	|			ТОГДА СчетНаОплатуПокупателюТовары.Содержание
//	|		КОГДА НЕ СчетНаОплатуПокупателюТовары.Номенклатура.НаименованиеПолное ПОДОБНО """"
//	|			ТОГДА СчетНаОплатуПокупателюТовары.Номенклатура.НаименованиеПолное
//	|		ИНАЧЕ СчетНаОплатуПокупателюТовары.Номенклатура.Наименование
//	|	КОНЕЦ,
//	|	СчетНаОплатуПокупателюТовары.СтавкаНДС,
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|			КОГДА ВТ_ОплачиваемыеДокументы.СуммаВключаетНДС
//	|				ТОГДА СчетНаОплатуПокупателюТовары.Цена
//	|			КОГДА СчетНаОплатуПокупателюТовары.Количество = 0
//	|				ТОГДА СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС
//	|			ИНАЧЕ (СчетНаОплатуПокупателюТовары.Сумма + СчетНаОплатуПокупателюТовары.СуммаНДС) / СчетНаОплатуПокупателюТовары.Количество
//	|		КОНЕЦ КАК ЧИСЛО(15, 2)),
//	|	СчетНаОплатуПокупателюТовары.Номенклатура
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ОплачиваемыеСчета.Документ,
//	|	ОплачиваемыеСчета.Организация,
//	|	ОплачиваемыеСчета.Дата,
//	|	ОплачиваемыеСчета.СуммаСкидкиПоДокументу,
//	|	ОплачиваемыеСчета.РасчетыВУсловныхЕдиницах
//	|		И ОплачиваемыеСчета.ВалютаДокумента <> ОплачиваемыеСчета.ВалютаПлатежа КАК РасчетыВУсловныхЕдиницах,
//	|	ОплачиваемыеСчета.СтавкаНДС,
//	|	ОплачиваемыеСчета.СуммаОплаты,
//	|	ОплачиваемыеСчета.СуммаВзаиморасчетов,
//	|	СУММА(ЕСТЬNULL(ОплатаСчетов.Сумма, 0)) КАК СуммаОплатыВсего
//	|ИЗ
//	|	ВТ_ОплачиваемыеДокументы КАК ОплачиваемыеСчета
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОплатаСчетов КАК ОплатаСчетов
//	|		ПО ОплачиваемыеСчета.Документ = ОплатаСчетов.СчетНаОплату
//	|			И ОплачиваемыеСчета.СтавкаНДС = ОплатаСчетов.СтавкаНДС
//	|			И ОплачиваемыеСчета.Организация = ОплатаСчетов.Организация
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ОплачиваемыеСчета.СтавкаНДС,
//	|	ОплачиваемыеСчета.Документ,
//	|	ОплачиваемыеСчета.Организация,
//	|	ОплачиваемыеСчета.Дата,
//	|	ОплачиваемыеСчета.СуммаОплаты,
//	|	ОплачиваемыеСчета.СуммаВзаиморасчетов,
//	|	ОплачиваемыеСчета.РасчетыВУсловныхЕдиницах
//	|		И ОплачиваемыеСчета.ВалютаДокумента <> ОплачиваемыеСчета.ВалютаПлатежа,
//	|	ОплачиваемыеСчета.СуммаСкидкиПоДокументу";
//	
//	Запрос.Текст = ТекстЗапросаРеквизитыПечатиЧека(НомераТаблиц) 
//		+ Документы.РеализацияТоваровУслуг.ТекстЗапросаРеализованнаяНоменклатура(НомераТаблиц)
//		+ Документы.СчетНаОплатуПокупателю.ТекстЗапросаДанныеДляПечатиЧека(НомераТаблиц);
//	
//	Результат = Запрос.ВыполнитьПакет();
//	
//	ПараметрыПечатиЧека = Новый Структура;
//	Для каждого НомерТаблицы Из НомераТаблиц Цикл
//		ПараметрыПечатиЧека.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
//	КонецЦикла;
//	
//	Возврат ПараметрыПечатиЧека;
//КонецФункции

#КонецОбласти

#КонецЕсли
